0.57.2119-1/Catalogs/ККСНГ_МашиночитаемыеДоверенности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ККСНГ_МашиночитаемыеДоверенности</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ККСНГ_Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИННДоверителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформационнаяСистема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоверенностиОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПервоначальнойДоверенности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаДоверенности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьФайлДоверенности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьФайлПодписи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлДоверенности</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлПодписи</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Доверители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИНН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОГРН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СНИЛС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>14</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подписанты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Полномочия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Представители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИНН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОГРН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СНИЛС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>14</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Сертификаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отпечаток</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сертификат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

0.57.2119-1/Catalogs/ККСНГ_МашиночитаемыеДоверенности/Forms/ФормаСпискаСертификатов/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Перем Сертификаты, Представители, Элемент;
	
	ЭтотОбъект.СпособАвторизацииОрганизации = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЭтотОбъект.Параметры, "СпособАвторизацииОрганизации");
	
	Сертификаты = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЭтотОбъект.Параметры, "Сертификаты");
	Представители = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЭтотОбъект.Параметры, "Представители");
	
	Если ТипЗнч(Представители) = Тип("ДанныеФормыКоллекция") Тогда
		ТаблицаЗначенийПредставители = Представители.Выгрузить();
		ЭтотОбъект.Представители.Загрузить(ТаблицаЗначенийПредставители);
	КонецЕсли;
	
	Если ТипЗнч(Сертификаты) = Тип("ДанныеФормыКоллекция") Тогда
		ТаблицаЗначенийСертификаты = Сертификаты.Выгрузить();
		ЭтотОбъект.Сертификаты.Загрузить(ТаблицаЗначенийСертификаты);
	КонецЕсли;
	
	ДополнитьДанныеСертификатов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Перем ОписаниеОповещения;
	
	Если Не ЗавершениеРаботы И ЭтотОбъект.Модифицированность Тогда
		Отказ = Истина;
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеОтветаНаВопрос", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, "Данные были изменены. Сохранить изменения?", РежимДиалогаВопрос.ДаНетОтмена, 0, КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СертификатыПриАктивизацииСтроки(Элемент)
	
	ОбновитьОтображениеКнопкиУдалить();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Добавить(Команда)
	
	Перем ПараметрыФормы, ОписаниеОповещения;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СпособАвторизацииОрганизации", ЭтотОбъект.СпособАвторизацииОрганизации);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораСертификата", ЭтотОбъект);
	ОткрытьФорму("Справочник.ККСНГ_МашиночитаемыеДоверенности.Форма.ФормаВыбораСертификата", ПараметрыФормы, , , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	УдалитьДублиСертификатов();
	ЭтотОбъект.Модифицированность = Ложь;
	ЭтотОбъект.Закрыть(ЭтотОбъект.Сертификаты);
	
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	
	Перем ТекущиеДанные;
	
	ТекущиеДанные = Элементы.Сертификаты.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ЭтотОбъект.Сертификаты.Удалить(ТекущиеДанные);
		ЭтотОбъект.Модифицированность = Истина;
	КонецЕсли;
	
	ОбновитьОтображениеКнопкиУдалить();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УдалитьДублиСертификатов()
	
	Перем Отпечатки, Сертификат, СтрокиКУдалению;
	
	Отпечатки = Новый Массив;
	СтрокиКУдалению = Новый Массив;
	
	Для каждого Сертификат Из ЭтотОбъект.Сертификаты Цикл
		Если Отпечатки.Найти(Сертификат.Отпечаток) <> Неопределено Тогда
			СтрокиКУдалению.Добавить(Сертификат);
			Продолжить;
		КонецЕсли;
		Отпечатки.Добавить(Сертификат.Отпечаток);
	КонецЦикла;
	
	Для каждого Сертификат Из СтрокиКУдалению Цикл
		ЭтотОбъект.Сертификаты.Удалить(Сертификат);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораСертификата(Результат, ДополнительныеДанные) Экспорт
	
	Если Результат <> Неопределено Тогда
		ПослеВыбораСертификатаНаСервере(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораСертификатаНаСервере(Результат)
	
	Перем СертификатСсылка, Сертификат;
	
	Если ТипЗнч(Результат) = Тип("СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования") И Не Результат.Пустая() Тогда
		
		СертификатСсылка = Результат;
		Сертификат = ЭтотОбъект.Сертификаты.Добавить();
		Сертификат.Сертификат = ККСНГ_ОбщегоНазначенияВызовСервера.ЗначениеВСтрокуXML(СертификатСсылка);
		Сертификат.СертификатСсылка = СертификатСсылка;
		
	ИначеЕсли ТипЗнч(Результат) = Тип("Структура") Тогда
		
		Сертификат = ЭтотОбъект.Сертификаты.Добавить();
		Сертификат.Наименование = Результат.Наименование;
		Сертификат.Отпечаток = ККСНГ_ОбщегоНазначенияКлиентСервер.УдалитьСимволыИзСтроки(ВРег(Результат.Отпечаток), " ");
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	ДополнитьДанныеСертификата(Сертификат);
	ЭтотОбъект.Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьДанныеСертификатов()
	
	Перем Сертификат;
	
	Для каждого Сертификат Из ЭтотОбъект.Сертификаты Цикл
		Если Не ПустаяСтрока(Сертификат.Сертификат) Тогда
			
			Попытка
				Сертификат.СертификатСсылка = ККСНГ_ОбщегоНазначенияВызовСервера.ЗначениеИзСтрокиXML(Сертификат.Сертификат);
			Исключение
				Продолжить;
			КонецПопытки;
			
			ДополнитьДанныеСертификата(Сертификат);
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьДанныеСертификата(Сертификат)
	
	Перем СертификатСсылка, ПараметрыОтбора;
	Перем ДвоичныеДанныеСертификата, СертификатКриптографии, СвойстваСертификата;
	
	Сертификат.ИНН = "";
	Сертификат.ОГРН = "";
	Сертификат.Картинка = "";
	Сертификат.Примечание = "";
	
	СертификатСсылка = Сертификат.СертификатСсылка;
	
	Если ТипЗнч(СертификатСсылка) = Тип("СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования") И Не СертификатСсылка.Пустая() Тогда
		
		ДвоичныеДанныеСертификата = СертификатСсылка.ДанныеСертификата.Получить();
		СертификатКриптографии = Новый СертификатКриптографии(ДвоичныеДанныеСертификата);
		СвойстваСертификата = ККСНГ_ЭлектроннаяПодписьКлиентСервер.ПолучитьСвойстваСертификата(СертификатКриптографии);
		
		Сертификат.Наименование = СвойстваСертификата.ОбщееИмя;
		Сертификат.ИНН = СвойстваСертификата.ИНН;
		Сертификат.ОГРН = ?(ЗначениеЗаполнено(СвойстваСертификата.ОГРН), СвойстваСертификата.ОГРН, СвойстваСертификата.ОГРНИП);
		Сертификат.Отпечаток = ККСНГ_ОбщегоНазначенияКлиентСервер.УдалитьСимволыИзСтроки(ВРег(СвойстваСертификата.Отпечаток), " ");
		
		// Поиск представителя если сертификат выпущен на физическое лицо
		Если ЭтотОбъект.Представители.Количество() > 0 И Не ЗначениеЗаполнено(Сертификат.ОГРН) Тогда
			
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("ИНН", Сертификат.ИНН);
			НайденныеСтроки = ЭтотОбъект.Представители.НайтиСтроки(ПараметрыОтбора);
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				Сертификат.Картинка = 1;
				Сертификат.Примечание = "Найден в списке представителей";
			Иначе
				Сертификат.Картинка = 2;
				Сертификат.Примечание = "Не найден в списке представителей";
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопрос(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		УдалитьДублиСертификатов();
		ЭтотОбъект.Модифицированность = Ложь;
		ЭтотОбъект.Закрыть(ЭтотОбъект.Сертификаты);
		
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		
		ЭтотОбъект.Модифицированность = Ложь;
		ЭтотОбъект.Закрыть();
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеКнопкиУдалить()
	
	Элементы.СертификатыЭПУдалить.Доступность = Элементы.Сертификаты.ТекущаяСтрока <> Неопределено;
	
КонецПроцедуры

#КонецОбласти
